# SQL_integration.

### Import liblaries

In [14]:
import sqlite3
import pandas as pd

### Create database

In [15]:
con = sqlite3.connect("../instacart.db")

### Read files

In [16]:
orders = pd.read_csv("../data/orders.csv")
products = pd.read_csv("../data/products.csv")
order_products_prior = pd.read_csv("../data/order_products__prior.csv")
order_products_train = pd.read_csv("../data/order_products__train.csv")
aisles = pd.read_csv("../data/aisles.csv")
departments = pd.read_csv("../data/departments.csv")

### Merge files to create order_products

In [17]:
order_products = pd.concat([order_products_prior, order_products_train], ignore_index=True)

### Upload to database

In [18]:
orders.to_sql("orders", con, if_exists="replace", index=False)
products.to_sql("products", con, if_exists="replace", index=False)
order_products.to_sql("order_products", con, if_exists="replace", index=False)
aisles.to_sql("aisles", con, if_exists="replace", index=False)
departments.to_sql("departments", con, if_exists="replace", index=False)

21

### Running sql files

In [19]:
def run_query(filename):
    with open(f"../sql_queries/{filename}", "r") as f:
        query = f.read()
    return pd.read_sql(query, con)

## 1. Distribution of orders by day

In [21]:
run_query("../sql/orders_by_day.sql")

   order_dow  num_orders
0          0      600905
1          1      587478
2          2      467260
3          3      436972
4          4      426339
5          5      453368
6          6      448761

## 2. Distribution of orders by hour

In [22]:
run_query("../sql/orders_by_hour.sql")

    order_hour_of_day  num_orders
0                   0       22758
1                   1       12398
2                   2        7539
3                   3        5474
4                   4        5527
5                   5        9569
6                   6       30529
7                   7       91868
8                   8      178201
9                   9      257812
10                 10      288418
11                 11      284728
12                 12      272841
13                 13      277999
14                 14      283042
15                 15      283639
16                 16      272553
17                 17      228795
18                 18      182912
19                 19      140569
20                 20      104292
21                 21       78109
22                 22       61468
23                 23       40043

## 3. Top 10 largest baskets

In [28]:
run_query("../sql/basket_size.sql")

   order_id  basket_size
0   1564244          145
1    790903          137
2     61355          127
3   2970392          121
4   2069920          116
5   3308010          115
6   2753324          114
7   2499774          112
8   2621625          109
9     77151          109

## 4. Most popular products

In [25]:
run_query("../sql/popular_products.sql")

             product_name  times_ordered
0                  Banana         491291
1  Bag of Organic Bananas         394930
2    Organic Strawberries         275577
3    Organic Baby Spinach         251705
4    Organic Hass Avocado         220877
5         Organic Avocado         184224
6             Large Lemon         160792
7            Strawberries         149445
8                   Limes         146660
9      Organic Whole Milk         142813

## 5. Most popular departments

In [26]:
run_query("../sql/popular_departments.sql")

         department  times_ordered
0           produce        9888378
1        dairy eggs        5631067
2            snacks        3006412
3         beverages        2804175
4            frozen        2336858
5            pantry        1956819
6            bakery        1225181
7      canned goods        1114857
8              deli        1095540
9   dry goods pasta         905340
10        household         774652
11     meat seafood         739238
12        breakfast         739069
13    personal care         468693
14           babies         438743
15    international         281155
16          alcohol         159294
17             pets         102221
18          missing          77396
19            other          38086
20             bulk          35932

## 6. Most popular aisles

In [29]:
run_query("../sql/popular_aisles.sql")

                           aisle  times_ordered
0                   fresh fruits        3792661
1               fresh vegetables        3568630
2     packaged vegetables fruits        1843806
3                         yogurt        1507583
4                packaged cheese        1021462
5                           milk         923659
6  water seltzer sparkling water         878150
7                 chips pretzels         753739
8                soy lactosefree         664493
9                          bread         608469

## 7. Reorder rate

In [30]:
run_query("../sql/reorder_rate.sql")

   reordered  num_products
0          0      13863746
1          1      19955360

## 8. Average time between orders

In [31]:
run_query("../sql/avg_days_between_orders.sql")

   avg_days_between_orders
0                11.114836